aethaniel/ExperimentalCore-sam/module/tools/CMSIS_SVD/ATSAMD21E.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <vendor>Atmel Corporation</vendor>
  <vendorID>ATMEL</vendorID>
  <name>ATSAMD21E</name>
  <series>SAMD21</series>
  <version>A</version>
  <description>Atmel ATSAMD21E device: Cortex-M0+ Microcontroller with 32-256KB Flash, 4-32KB SRAM, 32-64-pin package</description>
  <licenseText>
  ============================================================================\n
                   Atmel Microcontroller Software Support\n
  ============================================================================\n
  Copyright (c) 2014, Atmel Corporation\n
  \n
  All rights reserved.\n
  \n
  Redistribution and use in source and binary forms, with or without\n
  modification, are permitted provided that the following condition is met:\n
  \n
  - Redistributions of source code must retain the above copyright notice,\n
  this list of conditions and the disclaimer below.\n
  \n
  Atmel's name may not be used to endorse or promote products derived from\n
  this software without specific prior written permission.\n
  \n
  DISCLAIMER: THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR\n
  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n
  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE\n
  DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,\n
  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,\n
  OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\n
  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n
  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\n
  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n
  ============================================================================
  </licenseText>
  <cpu>
    <name>CM0+</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <vtorPresent>true</vtorPresent>
    <nvicPrioBits>2</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <headerSystemFilename>system_samd21</headerSystemFilename>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>AC</name>
      <version>1.1.1</version>
      <description>Analog Comparators</description>
      <groupName>AC</groupName>
      <prependToName>AC_</prependToName>
      <baseAddress>0x42004400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AC</name>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>COMPCTRL%s</name>
          <description>Comparator Control n</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SINGLE</name>
              <description>Single-Shot Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPEED</name>
              <description>Speed Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SPEEDSelect</name>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low speed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High speed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTSEL</name>
              <description>Interrupt Selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>INTSELSelect</name>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>Interrupt on comparator output toggle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Interrupt on comparator output rising</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Interrupt on comparator output falling</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOC</name>
                  <description>Interrupt on end of comparison (single-shot mode only)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXNEG</name>
              <description>Negative Input Mux Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>MUXNEGSelect</name>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>I/O pin 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>I/O pin 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>I/O pin 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>I/O pin 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSCALE</name>
                  <description>VDD scaler</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANDGAP</name>
                  <description>Internal bandgap voltage</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC output</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXPOS</name>
              <description>Positive Input Mux Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MUXPOSSelect</name>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>I/O pin 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>I/O pin 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>I/O pin 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>I/O pin 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWAP</name>
              <description>Swap Inputs and Invert</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT</name>
              <description>Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>OUTSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>The output of COMPn is not routed to the COMPn I/O port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <description>The asynchronous output of COMPn is routed to the COMPn I/O port</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST</name>
              <description>Hysteresis Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEN</name>
              <description>Filter Length</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>FLENSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No filtering</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAJ3</name>
                  <description>3-bit majority function (2 of 3)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAJ5</name>
                  <description>5-bit majority function (3 of 5)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMUX</name>
              <description>Low-Power Mux</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>START0</name>
              <description>Comparator 0 Start Comparison</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START1</name>
              <description>Comparator 1 Start Comparison</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x02</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>COMPEO0</name>
              <description>Comparator 0 Event Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPEO1</name>
              <description>Comparator 1 Event Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINEO0</name>
              <description>Window 0 Event Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPEI0</name>
              <description>Comparator 0 Event Input</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPEI1</name>
              <description>Comparator 1 Event Input</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Comparator 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1</name>
              <description>Comparator 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIN0</name>
              <description>Window 0 Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Comparator 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1</name>
              <description>Comparator 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIN0</name>
              <description>Window 0 Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Comparator 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1</name>
              <description>Comparator 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIN0</name>
              <description>Window 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>SCALER%s</name>
          <description>Scaler n</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Scaler Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSA</name>
          <description>Status A</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATE0</name>
              <description>Comparator 0 Current State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATE1</name>
              <description>Comparator 1 Current State</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WSTATE0</name>
              <description>Window 0 Current State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>WSTATE0Select</name>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>Signal is above window</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIDE</name>
                  <description>Signal is inside window</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>Signal is below window</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSB</name>
          <description>Status B</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>READY0</name>
              <description>Comparator 0 Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READY1</name>
              <description>Comparator 1 Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCBUSY</name>
              <description>Synchronization Busy</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSC</name>
          <description>Status C</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATE0</name>
              <description>Comparator 0 Current State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATE1</name>
              <description>Comparator 1 Current State</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WSTATE0</name>
              <description>Window 0 Current State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>WSTATE0Select</name>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>Signal is above window</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIDE</name>
                  <description>Signal is inside window</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>Signal is below window</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WINCTRL</name>
          <description>Window Control</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>WEN0</name>
              <description>Window 0 Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINTSEL0</name>
              <description>Window 0 Interrupt Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>WINTSEL0Select</name>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>Interrupt on signal above window</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIDE</name>
                  <description>Interrupt on signal inside window</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>Interrupt on signal below window</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTSIDE</name>
                  <description>Interrupt on signal outside window</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
