aethaniel/ExperimentalCore-sam/module/tools/CMSIS_SVD/ATSAMD21E.svd
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EVACT0</name>
              <description>Timer/counter Input Event0 Action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EVACT0Select</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Event action disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRIGGER</name>
                  <description>Start restart or re-trigger TC on event</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTEV</name>
                  <description>Count on event. Increment or decrement depending on count direction.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Count on event.Start counting on the event rising edge. Further events will not restart the counter; it keeps on counting using prescaled GCLK_TCCx, until it reaches TOP or Zero depending on the direction.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC</name>
                  <description>Increment TC on EVENT. Increment the counter on event, irrespective of count direction</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNT</name>
                  <description>Count on active state of asynchronous event</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT</name>
                  <description>Non-recoverable Fault</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVACT1</name>
              <description>Timer/counter Input Event1 Action</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EVACT1Select</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Event action disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRIGGER</name>
                  <description>Re-trigger TC on event</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIR</name>
                  <description>Direction control</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop TC on event</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEC</name>
                  <description>Decrement TC on event</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPW</name>
                  <description>Period captured into CC0 Pulse Width on CC1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWP</name>
                  <description>Period captured into CC1 Pulse Width on CC0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAULT</name>
                  <description>Non-recoverable Fault</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNTSEL</name>
              <description>Timer/counter Output Event Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CNTSELSelect</name>
                <enumeratedValue>
                  <name>START</name>
                  <description>An interrupt/event is generated when a new counter cycle starts</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>END</name>
                  <description>An interrupt/event is generated when a counter cycle ends</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BETWEEN</name>
                  <description>An interrupt/event is generated when a counter cycle ends, except for the first and last cycles.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOUNDARY</name>
                  <description>An interrupt/event is generated when a new counter cycle starts or a counter cycle ends</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVFEO</name>
              <description>Overflow/Underflow Output Event Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGEO</name>
              <description>Retrigger Output Event Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTEO</name>
              <description>Timer/counter Output Event Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCINV0</name>
              <description>Inverted Event 0 Input Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCINV1</name>
              <description>Inverted Event 1 Input Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCEI0</name>
              <description>Timer/counter Event 0 Input Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCEI1</name>
              <description>Timer/counter Event 1 Input Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEI0</name>
              <description>Match or Capture Channel 0 Event Input Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEI1</name>
              <description>Match or Capture Channel 1 Event Input Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEI2</name>
              <description>Match or Capture Channel 2 Event Input Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEI3</name>
              <description>Match or Capture Channel 3 Event Input Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO0</name>
              <description>Match or Capture Channel 0 Event Output Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO1</name>
              <description>Match or Capture Channel 1 Event Output Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO2</name>
              <description>Match or Capture Channel 2 Event Output Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO3</name>
              <description>Match or Capture Channel 3 Event Output Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTRLA</name>
          <description>Recoverable FaultA Configuration</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRC</name>
              <description>FaultA Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SRCSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTFAULT</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEEP</name>
              <description>FaultA Keeper</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QUAL</name>
              <description>FaultA Qualification</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLANK</name>
              <description>FaultA Blanking Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BLANKSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTART</name>
              <description>FaultA Restart</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALT</name>
              <description>FaultA Halt Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>HALTSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NR</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL</name>
              <description>FaultA Capture Channel</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CHSELSelect</name>
                <enumeratedValue>
                  <name>CC0</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC3</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTURE</name>
              <description>FaultA Capture Action</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CAPTURESelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPT</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMIN</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMAX</name>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMIN</name>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMAX</name>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DERIV0</name>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKVAL</name>
              <description>FaultA Blanking Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FILTERVAL</name>
              <description>FaultA Filter Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTRLB</name>
          <description>Recoverable FaultB Configuration</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRC</name>
              <description>FaultB Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SRCSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTFAULT</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEEP</name>
              <description>FaultB Keeper</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QUAL</name>
              <description>FaultB Qualification</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLANK</name>
              <description>FaultB Blanking Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>BLANKSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTART</name>
              <description>FaultB Restart</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALT</name>
              <description>FaultB Halt Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>HALTSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NR</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL</name>
              <description>FaultB Capture Channel</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CHSELSelect</name>
                <enumeratedValue>
                  <name>CC0</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC3</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTURE</name>
              <description>FaultB Capture Action</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CAPTURESelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPT</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMIN</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTMAX</name>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMIN</name>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCMAX</name>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DERIV0</name>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKVAL</name>
              <description>FaultB Blanking Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FILTERVAL</name>
              <description>FaultB Filter Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
