aethaniel/ExperimentalCore-sam/module/tools/CMSIS_SVD/ATSAMD21E.svd
       </cluster> <!-- UsbDevice -->
       <cluster>
        <name>HOST</name>
        <description>USB is Host</description>
        <alternateCluster>DEVICE</alternateCluster>
        <headerStructName>UsbHost</headerStructName>
        <addressOffset>0x0</addressOffset>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x000</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Operating Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>DEVICE</name>
                  <description>Device Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOST</name>
                  <description>Host Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DESCADD</name>
          <description>Descriptor Address</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DESCADD</name>
              <description>Descriptor Address Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FSMSTATUS</name>
          <description>Finite State Machine Status</description>
          <addressOffset>0x00D</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x01</resetValue>
          <fields>
            <field>
              <name>FSMSTATE</name>
              <description>Fine State Machine Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>FSMSTATESelect</name>
                <enumeratedValue>
                  <name>0x1</name>
                  <description>OFF (L3). It corresponds to the powered-off, disconnected, and disabled state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x2</name>
                  <description>ON (L0). It corresponds to the Idle and Active states</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x4</name>
                  <description>SUSPEND (L2)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x8</name>
                  <description>SLEEP (L1)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x10</name>
                  <description>DNRESUME. Down Stream Resume.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x20</name>
                  <description>UPRESUME. Up Stream Resume.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x40</name>
                  <description>RESET. USB lines Reset.</description>
                  <value>0x40</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>HOST Control B</description>
          <addressOffset>0x008</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>RESUME</name>
              <description>Send USB Resume</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPDCONF</name>
              <description>Speed Configuration for Host</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SPDCONFSelect</name>
                <enumeratedValue>
                  <name>0x0</name>
                  <description>Normal mode:the host starts in full-speed mode and performs a high-speed reset to switch to the high speed mode if the downstream peripheralis high-speed capable.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x1</name>
                  <description>reserved</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x2</name>
                  <description>reserved</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x3</name>
                  <description>Full-speed:the host remains in full-speed mode whatever is the peripheral speed capability. Releveant in UTMI mode only.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSTJ</name>
              <description>Test mode J</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTK</name>
              <description>Test mode K</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOFE</name>
              <description>Start of Frame Generation Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSRESET</name>
              <description>Send USB Reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBUSOK</name>
              <description>VBUS is OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L1RESUME</name>
              <description>Send L1 Resume</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLENHIGH</name>
          <description>HOST Host Frame Length</description>
          <addressOffset>0x012</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FLENHIGH</name>
              <description>Frame Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FNUM</name>
          <description>HOST Host Frame Number</description>
          <addressOffset>0x010</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>MFNUM</name>
              <description>Micro Frame Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FNUM</name>
              <description>Frame Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSOFC</name>
          <description>HOST Host Start Of Frame Control</description>
          <addressOffset>0x00A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLENC</name>
              <description>Frame Length Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FLENCE</name>
              <description>Frame Length Control Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>HOST Host Interrupt Enable Clear</description>
          <addressOffset>0x014</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>HSOF</name>
              <description>Host Start Of Frame Interrupt Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST</name>
              <description>BUS Reset Interrupt Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUP</name>
              <description>Wake Up Interrupt Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DNRSM</name>
              <description>DownStream to Device Interrupt Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPRSM</name>
              <description>Upstream Resume from Device Interrupt Disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMACER</name>
              <description>Ram Access Interrupt Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCONN</name>
              <description>Device Connection Interrupt Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDISC</name>
              <description>Device Disconnection Interrupt Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>HOST Host Interrupt Enable Set</description>
          <addressOffset>0x018</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>HSOF</name>
              <description>Host Start Of Frame Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST</name>
              <description>Bus Reset Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUP</name>
              <description>Wake Up Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DNRSM</name>
              <description>DownStream to the Device Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPRSM</name>
              <description>Upstream Resume fromthe device Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMACER</name>
              <description>Ram Access Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCONN</name>
              <description>Link Power Management Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDISC</name>
              <description>Device Disconnection Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>HOST Host Interrupt Flag</description>
          <addressOffset>0x01C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>HSOF</name>
              <description>Host Start Of Frame</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST</name>
              <description>Bus Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUP</name>
              <description>Wake Up</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DNRSM</name>
              <description>Downstream</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPRSM</name>
              <description>Upstream Resume from the Device</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMACER</name>
              <description>Ram Access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCONN</name>
              <description>Device Connection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDISC</name>
              <description>Device Disconnection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PINTSMRY</name>
          <description>HOST Pipe Interrupt Summary</description>
          <addressOffset>0x020</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EPINT0</name>
              <description>Pipe 0 Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT1</name>
              <description>Pipe 1 Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT2</name>
              <description>Pipe 2 Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT3</name>
              <description>Pipe 3 Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT4</name>
              <description>Pipe 4 Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT5</name>
              <description>Pipe 5 Interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT6</name>
              <description>Pipe 6 Interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT7</name>
              <description>Pipe 7 Interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>HOST Status</description>
          <addressOffset>0x00C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SPEED</name>
              <description>Speed Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LINESTATE</name>
              <description>USB Line State Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>BINTERVAL%s</name>
          <description>HOST Bus Access Period of Pipe</description>
          <addressOffset>0x103</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BITINTERVAL</name>
              <description>Bit Interval</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>PCFG%s</name>
          <description>HOST End Point Configuration</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PTOKEN</name>
              <description>Pipe Token</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BK</name>
              <description>Pipe Bank</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTYPE</name>
              <description>Pipe Type</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>PINTENCLR%s</name>
          <description>HOST Pipe Interrupt Flag Clear</description>
          <addressOffset>0x108</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TRCPT0</name>
              <description>Transfer Complete 0 Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRCPT1</name>
              <description>Transfer Complete 1 Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFAIL</name>
              <description>Error Flow Interrupt Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERR</name>
              <description>Pipe Error Interrupt Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXSTP</name>
              <description>Transmit  Setup Interrupt Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall Inetrrupt Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>PINTENSET%s</name>
          <description>HOST Pipe Interrupt Flag Set</description>
          <addressOffset>0x109</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TRCPT0</name>
              <description>Transfer Complete 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRCPT1</name>
              <description>Transfer Complete 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFAIL</name>
              <description>Error Flow Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERR</name>
              <description>Pipe Error Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXSTP</name>
              <description>Transmit  Setup Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
